Tekla Open API Reference for Tekla Structures 2025
SettingsProxy Class
 The SettingsProxy class is a proxy for the settings.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 Tekla.Structures.Datatype.SettingsProxy
 Namespace: Tekla.Structures.Datatype
 Assembly: Tekla.Structures.Datatype (in Tekla.Structures.Datatype.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class SettingsProxy : MarshalByRefObject
Public Class SettingsProxy
	Inherits MarshalByRefObject
The SettingsProxy type exposes the following members.
Constructors
Name | Description
SettingsProxy
 Creates a new settings proxy instance.
Top
Methods
Name | Description
GetValue
 Gets the value of the setting with the given name.
SetValue
 Sets a setting to a value.
TryGetValue
 Tries to get the value of the setting with the given name.
Top
See Also
Reference
Tekla.Structures.Datatype Namespace